//2. Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

var c = 15;/*переменная с*/
var d = 2;/*переменная d*/
var result = c + d;/*сумма переменных c и d присвоина переменной result*/

alert (result);/*значение переменной result на экране*/

//3. Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.

var a=10;
var b=2;
var c=5;

alert (a+b+c);

//4. Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7.

var a = 17;
var b = 10;
var c = a-b;
var d = 7;

//5. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

var result = c+d;

alert(result);

//6. Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.

var str = 'Привет Мир!';

alert(str);

//7. Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

var str1 = 'Привет!';
var str2 = 'Мир!';

alert(str1+str2);

//8. Создайте переменную name и присвойте ей ваше имя. = Выведите на экран фразу 'Привет, %Имя%!'.

var name = 'Оля!';

alert('Привет,'+name);

//9. Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.

var age = 29;

alert('Мне '+ age +'лет!');